BreweryCRM/Documents/Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Заказы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУпаковки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыУпаковок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

BreweryCRM/InformationRegisters/ИсторияВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИсторияВзаимодействий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BreweryCRM/Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BreweryCRM/Enums/ТипыВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыВзаимодействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОформлениеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписаниеСоглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеЗаказа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BreweryCRM/Documents/Заказы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МаршрутОтображение();
КонецПроцедуры

&НаСервере
Процедура МаршрутОтображение()
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Доставка Тогда
		Элементы.Маршрут.Видимость = ИСТИНА	 
	Иначе  
		Объект.Маршрут = Неопределено; 
		Элементы.Маршрут.Видимость = ЛОЖЬ;      
	КонецЕсли; 	     
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	МаршрутОтображение();
КонецПроцедуры     

&НаКлиенте
Процедура СоставЗаказаКоличествоЦенаСтоимостьПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоимость = СтрокаТабличнойЧасти.ЦенаЗаЕд * СтрокаТабличнойЧасти.Количество;
	ОбщаяСтоимостьРасчет();
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)    
	Клиент = Объект.Клиент;
	Форма = ПолучитьФорму("Справочник.ФайлыКлиентов.Форма.ФормаЭлемента");    
	Форма.Объект.Владелец = Клиент;
	Форма.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Объект.Дата = ТекущаяДата();
	История = РегистрыСведений.ИсторияВзаимодействий.СоздатьНаборЗаписей(); 
	История.Прочитать();
	ЗаписьИстории = История.Добавить();
	ЗаписьИстории.Клиент = Объект.Клиент;
	ЗаписьИстории.ТипВзаимодействия = Перечисления.ТипыВзаимодействий.ОформлениеЗаказа; 
	ЗаписьИстории.Период = Объект.Дата;
	История.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаИтогСтоимостьПриИзменении(Элемент)
	ОбщаяСтоимостьРасчет();
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяСтоимостьРасчет()
	Объект.ОбщаяСтоимость = Объект.СоставЗаказа.Итог("Стоимость");
КонецПроцедуры
